{
    "Hey_Im_Eugene": "Привіт, я Євген ✌️",
    "Frontend": "Front-End Розробник",
    "Main_First_Text": "Я Front-End розробник, який спеціалізується на створенні виняткового цифрового досвіду.",
    "Main_Second_Text": "Лорем іпсум долор сіт амет консектетур.",
    "Home": "Головна",
    "About": "Про мене",
    "Skills": "Навички",
    "Projects": "Проекти",
    "Contact": "Зв'язатися",
    "Mob_Menu_Text": "Лорем іпсум долор сіт амет консектетур.",
    "Find_Me_Here": "Шукайте мене тут",
    "Who_I_Am": "Хто я такий",
    "About_First_Text": "Я спеціалізуюся на створенні додатків Front-End UI, адаптованих до мобільних пристроїв, які з’єднуються з API та іншими технологіями серверної частини. Незважаючи на це, я найбільш досвідчений у створенні зовнішніх додатків за допомогою HTML, CSS, Javascript та React, я швидко навчаюся і зможу вивчити нові технологічні стеки за потреби.",
    "About_Second_Text": "Я закінчив НТУУ «КПІ» за ступенем бакалавра комп’ютерних наук, але моя пристрасть до Front-End почалася в 2019 році. Найкраща практика, яку я отримав від свого університету, — це гуглити інформацію та бути гнучким :) Я захоплений вивченням нових технологій і розумію, що існує більше ніж один спосіб виконати завдання. Я твердо вірю, що бути чудовим розробником означає не використовувати одну конкретну технологію, а вибрати найкращий інструмент для роботи.",
    "Check_Projects": "Перегляньте деякі з моїх останніх проектів.",
    "What_I_Can_Do": "Що я вмію",
    "What_Ive_Built": "Що я створив",
    "More_Info": "Докладніше",
    "Project": "Проект",
    "Overview": "Огляд",
    "Demo": "Демо",
    "Code": "Код",
    "Back": "Назад",
    "Technologies": "Технології",
    "Property_Project_Text": "Ця програма створена за допомогою React JS і розміщена на Firebase. Користувачі можуть шукати властивості за адресою, містом або поштовим індексом щоб отримати список активних властивостей, які зараз продаються. Ти будеш мати можливість переглядати інформацію про нерухомість, а також конкретні розташування власності, інтегрованої з Google Maps API. Користувач автентифікація доступна, тому ви можете зареєструватися та ввійти до свого облікового запису з адресою електронної пошти, щоб зберегти свій улюблений властивості. Це стало можливим завдяки Zillow API.",
    "Crypto_Project_Text": "Я створив цю програму, щоб продемонструвати знання роботи в React JS і доступу до кінцевих точок API. Ця програма створена за допомогою React JS і розміщена на Firebase. Ця програма підтримує автентифікацію користувачів за допомогою Firebase. Користувачі можуть створити новий обліковий запис, використовуючи свою адресу електронної пошти, а потім можуть увійти, щоб зберегти монети в списку користувача. Це стало можливим завдяки створенню бази даних хмарного сховища firestore під час реєстрації користувача. Ще одна особливість цієї програми — динамічна маршрутизація через DOM-пакет React Router. Ця програма створена за допомогою Coin Gecko API.",
    "Netflix_Project_Text": "Я створив цю програму в React JS, і вона розміщена на сторінках GitHub. Ця програма включає автентифікацію користувача за допомогою firebase, а також базу даних хмарного сховища firestore. Ця програма отримує дані про фільми з API фільмів IMDB і відображає різні категорії. Він має горизонтальне ковзання та вибір. Хук useContext також реалізується для керування станом у всьому додатку.",
    "Twitch_Project_Text": "Ця програма створена за допомогою NEXT.JS і оформлена за допомогою Tailwind CSS. Додаток розміщується статично за допомогою Vercel. Це адаптивне для мобільних пристроїв відтворення Twitch.tv із функціями Next/Auth.js для автентифікації. Користувачі можуть вибрати автентифікацію за допомогою облікового запису Github або облікового запису Google. У цьому проекті варто звернути увагу на кілька особливостей: відкладене завантаження зображень за допомогою компонента Image, вбудовану маршрутизацію та Context Next/Auth.",
    "Get_In_Touch": "Наладимо контакт",
    "EK": "Євген Карташян",
    "Contact_Text": "Я доступний для роботи на неповний або повний робочий день." ,
    "Connect_With_Me": "Зв'язатися зі мною",
    "Form_Name": "Ім'я",
    "Form_Phone": "Номер телефону",
    "Form_Email": "Електронна пошта",
    "Form_Message": "Повідомлення",
    "Form_Button": "Надіслати повідомлення",
    "Soon": "Незабаром я завантажу сюди щось...",
    "Site": "*Веб-сайт новий, тому деякі функції можуть ще не працювати.*"
  }
